


                              IC Compiler II (TM)

             Version O-2018.06-SP1 for linux64 - Jul 17, 2018 -SLE

                    Copyright (c) 1988 - 2018 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.

set design RISCV
RISCV
sh rm /home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_setup/design.ndm.lock
Error: rm: cannot remove '/home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_setup/design.ndm.lock': No such file or directory
	Use error_info for more info. (CMD-013)
Information: script '/home/ICer/test_RISCV/pnr/fp/script/fp.tcl'
	stopped at line 3 due to error. (CMD-081)
Extended error info:
rm: cannot remove '/home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_setup/design.ndm.lock': No such file or directory
    while executing
"exec sh -c {rm /home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_setup/design.ndm.lock}"
    ("uplevel" body line 1)
    invoked from within
"# Compiled -- no source code available
error "called a copy of a compiled script""
    (procedure "sh" line 1)
    invoked from within
"sh rm /home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_setup/design.ndm.lock"
 -- End Extended Error Info
icc2_shell> set design RISCV
RISCV
icc2_shell> sh rm /home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_setup/design.ndm.lock
Error: rm: cannot remove '/home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_setup/design.ndm.lock': No such file or directory
	Use error_info for more info. (CMD-013)
icc2_shell> 
icc2_shell>  
icc2_shell> set design_lib_path /home/ICer/test_RISCV/pnr/setup
/home/ICer/test_RISCV/pnr/setup
icc2_shell> open_block $design_lib_path/${design}.dlib:${design}_setup.design
Information: User units loaded from library 'saed90nm_max' (LNK-040)
Opening block 'RISCV.dlib:RISCV_setup.design' in edit mode
{RISCV.dlib:RISCV_setup.design}
icc2_shell> copy_block -from_block ${design}.dlib:${design}_setup.design -to_block ${design}_fp
{RISCV.dlib:RISCV_fp.design}
icc2_shell> current_block ${design}_fp.design
{RISCV.dlib:RISCV_fp.design}
icc2_shell> #start_gui
icc2_shell> 
icc2_shell> set_attribute [get_layers {M1 M3 M5 M7 M9}] routing_direction horizontal
Information: The design specific attribute override for layer 'M1' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for layer 'M3' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for layer 'M5' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for layer 'M7' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for layer 'M9' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M1 M3 M5 M7 M9}
icc2_shell> set_attribute [get_layers {M2 M4 M6 M8}] routing_direction vertical
Information: The design specific attribute override for layer 'M2' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for layer 'M4' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for layer 'M6' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for layer 'M8' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M2 M4 M6 M8}
icc2_shell> 
icc2_shell> set_attribute [get_layers {M1}] track_offset 0.03
Information: The design specific attribute override for layer 'M1' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M1}
icc2_shell> set_attribute [get_layers {M2}] track_offset 0.03
Information: The design specific attribute override for layer 'M2' is set in the current block 'RISCV_fp', because the actual library setting may not be overwritten. (ATTR-12)
{M2}
icc2_shell> 
icc2_shell> set_ignored_layers -max_routing_layer [get_layers {M8}]
Using libraries: RISCV.dlib saed90nm_max
Warning: In library RISCV.dlib, no block views exist for block RISCV. (LNK-064)
Visiting block RISCV.dlib:RISCV_fp.design
Design 'RISCV' was successfully linked.
1
icc2_shell> set_ignored_layers -max_routing_layer [get_layers {M9}]
1
icc2_shell> 
icc2_shell> set Name_unit [get_site_defs]
{unit}
icc2_shell> set_attribute [get_site_defs $Name_unit] is_default true
{unit}
icc2_shell> set_attribute [get_site_defs  $Name_unit] symmetry {Y}
{unit}
icc2_shell> 
icc2_shell> initialize_floorplan -core_utilization 0.55 -shape R -orientation N -core_offset {10} -s ide_ratio {1 1} -flip_first_row false
Removing existing floorplan objects
Creating core...
Core utilization ratio = 55.25%
Unplacing all cells...
Creating site array...
Creating routing tracks...
Initializing floorplan completed.
icc2_shell> 
icc2_shell> place_pins -ports [get_ports *]
Begin building search trees for block RISCV.dlib:RISCV_fp.design
Done building search trees for block RISCV.dlib:RISCV_fp.design (time 0s)

Min routing layer: M1
Max routing layer: M9


Number of block ports: 48
Number of block pin locations assigned from router: 0
Number of PG ports on blocks: 0
Number of pins created: 48
CPU Time for Pin Placement: 00:00:00.01u 00:00:00.00s 00:00:00.02e: 
Total Pin Placement CPU Time: 00:00:00.03u 00:00:00.00s 00:00:00.03e: 
1
icc2_shell> 
icc2_shell> 
icc2_shell> save_block 
Information: Saving block 'RISCV.dlib:RISCV_fp.design'
1
icc2_shell> 
icc2_shell> report_ports [all_inputs] > ../report/input_port.rpt
icc2_shell> report_ports [all_outputs] > ../report/output_port.rpt
icc2_shell> report_cell  > ../report/cells.rpt
icc2_shell> report_nets  > ../report/nets.rpt
icc2_shell> report_qor   > ../report/qor.rpt
icc2_shell> report_utilization > ../report/utilization.rpt
icc2_shell> get_placement_blockages > ../report/Blockage.rpt
icc2_shell> 
icc2_shell> # ================================================ #
icc2_shell> # =================== End_Step =================== #
icc2_shell> # ================================================ #
icc2_shell> write_def ../output/cv32e40p_top.def
****************************************
Report : Data Mismatches
Version: O-2018.06-SP1
Date   : Sun Aug 24 07:11:38 2025
****************************************
No mismatches exist on the design.
---------------------------------------
Number of Written DEF Constructs
---------------------------------------
VERSION                        : 1
DIVIDERCHAR                    : 1
BUSBITCHARS                    : 1
DESIGN                         : 1
UNITS                          : 1
PROPERTYDEFINITIONS            : 1
DIEAREA                        : 1
ROW                            : 199
TRACKS                         : 18
COMPONENTS                     : 19296
PINS                           : 48
PINPROPERTIES                  : 48
NETS                           : 20845
1
icc2_shell> write_verilog -include {all} ../output/cv32e40p_top.v
1
icc2_shell> write_sdc -output ../output/cv32e40p_top.sdc
1
icc2_shell> 
icc2_shell> # =================== End_Step =================== #
icc2_shell> save_block 
Information: Saving block 'RISCV.dlib:RISCV_fp.design'
1
icc2_shell> exit
Maximum memory usage for this session: 227.27 MB
CPU usage for this session:      6 seconds (  0.00 hours)
Elapsed time for this session:     48 seconds (  0.01 hours)
Thank you for using IC Compiler II.
