###################################################################

# Created by write_sdc on Thu Aug 28 00:25:50 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_capacitance 3 [current_design]
set_max_fanout 10 [current_design]
set_driving_cell -lib_cell NBUFFX4 -pin Z [get_ports rst]
set_driving_cell -lib_cell NBUFFX4 -pin Z [get_ports test_mode]
set_load -pin_load 4 [get_ports {dummy_out[31]}]
set_load -pin_load 4 [get_ports {dummy_out[30]}]
set_load -pin_load 4 [get_ports {dummy_out[29]}]
set_load -pin_load 4 [get_ports {dummy_out[28]}]
set_load -pin_load 4 [get_ports {dummy_out[27]}]
set_load -pin_load 4 [get_ports {dummy_out[26]}]
set_load -pin_load 4 [get_ports {dummy_out[25]}]
set_load -pin_load 4 [get_ports {dummy_out[24]}]
set_load -pin_load 4 [get_ports {dummy_out[23]}]
set_load -pin_load 4 [get_ports {dummy_out[22]}]
set_load -pin_load 4 [get_ports {dummy_out[21]}]
set_load -pin_load 4 [get_ports {dummy_out[20]}]
set_load -pin_load 4 [get_ports {dummy_out[19]}]
set_load -pin_load 4 [get_ports {dummy_out[18]}]
set_load -pin_load 4 [get_ports {dummy_out[17]}]
set_load -pin_load 4 [get_ports {dummy_out[16]}]
set_load -pin_load 4 [get_ports {dummy_out[15]}]
set_load -pin_load 4 [get_ports {dummy_out[14]}]
set_load -pin_load 4 [get_ports {dummy_out[13]}]
set_load -pin_load 4 [get_ports {dummy_out[12]}]
set_load -pin_load 4 [get_ports {dummy_out[11]}]
set_load -pin_load 4 [get_ports {dummy_out[10]}]
set_load -pin_load 4 [get_ports {dummy_out[9]}]
set_load -pin_load 4 [get_ports {dummy_out[8]}]
set_load -pin_load 4 [get_ports {dummy_out[7]}]
set_load -pin_load 4 [get_ports {dummy_out[6]}]
set_load -pin_load 4 [get_ports {dummy_out[5]}]
set_load -pin_load 4 [get_ports {dummy_out[4]}]
set_load -pin_load 4 [get_ports {dummy_out[3]}]
set_load -pin_load 4 [get_ports {dummy_out[2]}]
set_load -pin_load 4 [get_ports {dummy_out[1]}]
set_load -pin_load 4 [get_ports {dummy_out[0]}]
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
set_clock_uncertainty -setup 0.3  [get_clocks clk]
set_clock_uncertainty -hold 0.2  [get_clocks clk]
set_input_delay -clock clk  -max 0.05  [get_ports rst]
set_input_delay -clock clk  -max 0.05  [get_ports test_mode]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[31]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[30]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[29]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[28]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[27]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[26]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[25]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[24]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[23]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[22]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[21]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[20]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[19]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[18]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[17]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[16]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[15]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[14]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[13]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[12]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[11]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[10]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[9]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[8]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[7]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[6]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[5]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[4]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[3]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[2]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[1]}]
set_output_delay -clock clk  -max 0.05  [get_ports {dummy_out[0]}]
