#@ # 
#@ # Running icc2_shell Version O-2018.06-SP1 for linux64 -- Jul 17, 2018
#@ # Date:   Sun Aug 24 08:34:09 2025
#@ # Run by: ICer@IC_EDA
#@ 

read_verilog ../output/RISCV.top
read_verilog ../output/RISCV_top.v
read_verilog ../output/RISCV.v
read_sdc ../output/RISCV.sdc
report_timing
exit
