
icc2_shell> set design RISCV
RISCV
icc2_shell> 
icc2_shell> sh rm /home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_pp/design.ndm.lock
Error: rm: cannot remove '/home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_pp/design.ndm.lock': No such file or directory
        Use error_info for more info. (CMD-013)
icc2_shell> set design_lib_path /home/ICer/test_RISCV/pnr/setup
/home/ICer/test_RISCV/pnr/setup
icc2_shell> open_block $design_lib_path/${design}.dlib:${design}_pp.design
Information: User units loaded from library 'saed90nm_max' (LNK-040)
Opening block 'RISCV.dlib:RISCV_pp.design' in edit mode
Information: loading PG routing via master rules, patterns, strategies and strategy via rules.
{RISCV.dlib:RISCV_pp.design}
icc2_shell> copy_block -from_block ${design}.dlib:${design}_pp.design -to_block ${design}_placement
Error: 'copy_block' failed. Block 'RISCV.dlib:RISCV_placement.design' is locked by process 44790 ICer@IC_EDA. (NDM-029)
icc2_shell> current_block ${design}_placement.design
Warning: Nothing implicitly matched 'RISCV_placement.design' (SEL-003)
Error: Nothing matched for design (SEL-005)
icc2_shell> set design RISCV
RISCV
icc2_shell> 
icc2_shell> sh rm /home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_pp/design.ndm.lock
Error: rm: cannot remove '/home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_pp/design.ndm.lock': No such file or directory
        Use error_info for more info. (CMD-013)
icc2_shell> set design_lib_path /home/ICer/test_RISCV/pnr/setup
/home/ICer/test_RISCV/pnr/setup
icc2_shell> open_block $design_lib_path/${design}.dlib:${design}_pp.design
Information: Incrementing open_count of block 'RISCV.dlib:RISCV_pp.design' to 2. (DES-021)
{RISCV.dlib:RISCV_pp.design}
icc2_shell> copy_block -from_block ${design}.dlib:${design}_pp.design -to_block ${design}_placement
Error: 'copy_block' failed. Block 'RISCV.dlib:RISCV_placement.design' is locked by process 44790 ICer@IC_EDA. (NDM-029)
icc2_shell> set design RISCV
RISCV
icc2_shell> 
icc2_shell> sh rm /home/ICer/test_RISCV/pnr/setup/RISCV.dlib/RISCV_pp/design.ndm.lock
icc2_shell> set design_lib_path /home/ICer/test_RISCV/pnr/setup
/home/ICer/test_RISCV/pnr/setup
icc2_shell> open_block $design_lib_path/${design}.dlib:${design}_pp.design
Information: Incrementing open_count of block 'RISCV.dlib:RISCV_pp.design' to 3. (DES-021)
{RISCV.dlib:RISCV_pp.design}
icc2_shell> copy_block -from_block ${design}.dlib:${design}_pp.design -to_block ${design}_placement
Information: Overwriting block 'RISCV_placement.design' in library 'RISCV.dlib'. (DES-025)
{RISCV.dlib:RISCV_placement.design}
icc2_shell> current_block ${design}_placement.design
{RISCV.dlib:RISCV_placement.design}
icc2_shell> start_gui
Begin building search trees for block RISCV.dlib:RISCV_placement.design
Done building search trees for block RISCV.dlib:RISCV_placement.design (time 0s)
icc2_shell> link_block
Using libraries: RISCV.dlib saed90nm_max
Warning: In library RISCV.dlib, no block views exist for block RISCV. (LNK-064)
Visiting block RISCV.dlib:RISCV_placement.design
Design 'RISCV' was successfully linked.
1
icc2_shell> 